/* PIC16F1827 Configuration Bit Settings */

/* 'C' source line config statements */

/* CONFIG1 */
#pragma config FOSC = INTOSC    // Oscillator Selection (INTOSC oscillator: I/O function on CLKIN pin)
#pragma config WDTE = OFF       // Watchdog Timer Enable (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable (PWRT disabled)
#pragma config MCLRE = ON       // MCLR Pin Function Select (MCLR/VPP pin function is MCLR)
#pragma config CP = OFF         // Flash Program Memory Code Protection (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Memory Code Protection (Data memory code protection is disabled)
#pragma config BOREN = ON       // Brown-out Reset Enable (Brown-out Reset enabled)
#pragma config CLKOUTEN = OFF   // Clock Out Enable (CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin)
#pragma config IESO = ON        // Internal/External Switchover (Internal/External Switchover mode is enabled)
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enable (Fail-Safe Clock Monitor is enabled)

/* CONFIG2 */
#pragma config WRT = OFF        // Flash Memory Self-Write Protection (Write protection off)
#pragma config PLLEN = ON       // PLL Enable (4x PLL enabled)
#pragma config STVREN = OFF      // Stack Overflow/Underflow Reset Enable (Stack Overflow or Underflow will cause a Reset)
#pragma config BORV = LO        // Brown-out Reset Voltage Selection (Brown-out Reset Voltage (Vbor), low trip point selected.)
#pragma config LVP = ON         // Low-Voltage Programming Enable (Low-voltage programming enabled)

/* #pragma config statements should precede project file includes. */
/* Use project enums instead of #define for ON and OFF. */

/*==========================================================================================================================================*/



/*
 * File:   main.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>


/* 共通マクロ設定 */
#define     CLEAR   0U
#define     SET     1U

/* 共通型名称 */
typedef  unsigned char   u8;
typedef  unsigned short  u16;
typedef  unsigned long   u32;


/* 関数プロトタイプ宣言 */
static void func_main_s_variable_init( void );
static void func_main_s_register_setup( void );
static void func_main_s_program_start( void );
static void func_main_s_loop( void );
static void func_main_s_timer4_match_int_task( void );

/* 変数宣言 */
static u8 u8_main_s_loop_go;
static u8 u8_main_s_20ms_task_flag;
static u8 u8_main_s_dacout_step;

/**************************************************************/
/*  Function:                                                 */
/*  main task                                                 */
/*                                                            */
/**************************************************************/
void main(void)
{   
    func_main_s_register_setup();       /* レジスタ初期化 */
    func_main_s_variable_init();        /* 変数初期化 */
    func_main_s_program_start();        /* プログラム開始設定 */

    while(1)
    { /* 20ms 周期タスク */
        if( u8_main_s_loop_go == SET )
        {
            func_main_s_loop();
            u8_main_s_loop_go = CLEAR;
        }
    }
}



/**************************************************************/
/*  Function:                                                 */
/*  割り込み処理                                               */
/*  割り込み発生時にここに来る                                  */
/**************************************************************/
void __interrupt() isr( void )
{
    if( (PIR3 & 0x02U) != 0  )
    { /* TMR4 一致割り込み発生 */
        func_main_s_timer4_match_int_task();        /* TMR4 一致割り込み処理 */

        PIR3 &= (u8)~0x02U;      /* 割り込みフラグクリア */
    }
}





/*******************/
/* static function */
/*******************/
/**************************************************************/
/*  Function:                                                 */
/*  メインループ処理                                           */
/*                                                            */
/**************************************************************/
static void func_main_s_loop( void )
{
    u8 u8_loop_cnt;

    /* テスト出力 */
    /* 20ms感覚で出力反転 */
    if( u8_main_s_20ms_task_flag == CLEAR )
    {
        u8_main_s_20ms_task_flag = SET;
        PORTA |= 0x01U;      /* RA0 : HI */
    }
    else
    {
        u8_main_s_20ms_task_flag = CLEAR;
        PORTA &= 0x00U;      /* RA0 : LOW */
    }

    /* DAC出力設定 */
    DACCON1 = u8_main_s_dacout_step;

    u8_main_s_dacout_step++;
    if( u8_main_s_dacout_step >= (u8)32 )
    { /* のこぎり波で設定 */
        u8_main_s_dacout_step = (u8)0;
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  変数初期設定                                               */
/*                                                            */
/**************************************************************/
static void func_main_s_variable_init( void )
{
    u8_main_s_loop_go = CLEAR;
    u8_main_s_20ms_task_flag = CLEAR;
    u8_main_s_dacout_step = CLEAR;
}


/**************************************************************/
/*  Function:                                                 */
/*  レジスタ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_main_s_register_setup( void )
{
    /* クロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : SPLLEN  */ /* PLL 無効化 ※#pragmaセクションで設定したので、実際は常時許可状態(datasheet P.67) */
                            /*  | +----------------------- 6 : IRCF<3> */ /* 1110 : 32MHz HFINTOSC に設定 */
                            /*  | | +--------------------- 5 : IRCF<2> */ 
                            /*  | | | +------------------- 4 : IRCF<1> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : IRCF<0> */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : SCS<1>  */ /* 00 : FOSC ※#pragmaセクションで設定している */
                            /*  | | | |     | | | + ------ 0 : SCS<0>  */
    OSCCON =  0x70U;         /*  0 1 1 1  -  0 # 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* クロック周波数微調整 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TUN5    */
                            /*  | | | +------------------- 4 : TUN4    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TUN3    */
                            /*  | | | |     | +----------- 2 : TUN2    */
                            /*  | | | |     | | +--------- 1 : TUN1    */
                            /*  | | | |     | | | + ------ 0 : TUN0    */
    OSCTUNE =  0x00U;        /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 特に調整するつもりはないので初期設定                               */
    /*=================================================================*/


    /* Option register setup */
    /* 今回は#pragmaセクションで設定したので、設定しなくてもOK。 */


    /* 割り込み設定 1 */
    /*=================================================================*/
                            /*  +------------------------- 7 : GIE     */   /* 全体割り込み 許可 */
                            /*  | +----------------------- 6 : PEIE    */   /* ペリフェラル割り込み 許可 */
                            /*  | | +--------------------- 5 : TMR0IE  */   /* タイマ0割り込み 禁止 */
                            /*  | | | +------------------- 4 : INTE    */   /* 外部割込み 禁止 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : IOCIE   */   /* 外部ピン変化割り込み 禁止 */
                            /*  | | | |     | +----------- 2 : TMR0IF  */   /* タイマ0 オーバーフロー割り込み禁止 */
                            /*  | | | |     | | +--------- 1 : INTF    */   /* 外部割込みフラグ クリア */
                            /*  | | | |     | | | + ------ 0 : IOCIF   */   /* 外部ピン変化割り込みフラグ クリア */
    INTCON =  0x40U;        /*  0 1 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 初期化時点では全体割り込みは無効化しておく                          */
    /*=================================================================*/


    /* 割り込み設定 2 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : CCP4IE  */   /* CCP4割り込み 禁止 */
                            /*  | | | +------------------- 4 : CCP3IE  */   /* CCP3割り込み 禁止 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR6IE  */   /* タイマ6 一致割り込み 禁止 */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : TMR4IE  */   /* タイマ4 一致割り込み 許可 */
                            /*  | | | |     | | | + ------ 0 : -       */
    PIE3 = 0x02U;           /*  0 0 0 0  -  0 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* 割り込み設定 3 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : CCP4IF  */   /* CCP4割り込みフラグ クリア */
                            /*  | | | +------------------- 4 : CCP3IF  */   /* CCP3割り込みフラグ クリア */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR6IF  */   /* タイマ6 一致割り込みフラグ クリア */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : TMR4IF  */   /* タイマ4 一致割り込みフラグ クリア */
                            /*  | | | |     | | | + ------ 0 : -       */
    PIR3 = 0x00U;            /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* ポート入出力方向設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : TRISA7  */
                            /*  | +----------------------- 6 : TRISA6  */
                            /*  | | +--------------------- 5 : TRISA5  */
                            /*  | | | +------------------- 4 : TRISA4  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISA3  */
                            /*  | | | |     | +----------- 2 : TRISA2  */
                            /*  | | | |     | | +--------- 1 : TRISA1  */
                            /*  | | | |     | | | + ------ 0 : TRISA0  */
    TRISA = 0x20U;          /*  0 0 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/


    /* ポート出力データ設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : RA7     */
                            /*  | +----------------------- 6 : RA6     */
                            /*  | | +--------------------- 5 : RA5     */
                            /*  | | | +------------------- 4 : RA4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RA3     */
                            /*  | | | |     | +----------- 2 : RA2     */
                            /*  | | | |     | | +--------- 1 : RA1     */
                            /*  | | | |     | | | + ------ 0 : RA0     */
    PORTA = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* タイマ4の設定 */
    /* ※一致割り込みを使用するだけなら、CCPの設定はいらない */
    /* タイマレジスタ初期化 */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR4 = 0xFFU;            /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* タイマ4初期設定 */
    /* 今回は100msの定期割り込みを発生させたい */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : TxOUTPS<3> */    /* タイマ4 ポストスケーラ：1001 -> 1/10 */
                            /*  | | +--------------------- 5 : TxOUTPS<2> */
                            /*  | | | +------------------- 4 : TxOUTPS<1> */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : TxOUTPS<0> */
                            /*  | | | |     | +----------- 2 : TMRxON     */    /* タイマ4動作 停止 */
                            /*  | | | |     | | +--------- 1 : TxCKPS<1>  */    /* タイマ4 プリスケーラ：11 -> 1/64 */
                            /*  | | | |     | | | + ------ 0 : TxCKPS<0>  */
    T4CON = 0x4BU;          /*  0 1 0 0  -  1 0 1 1            */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* クロック:32MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 8MHz                                  */
    /* 割り込みポストスケーラ：1:10 -> 800kHz                               */
    /* プリスケーラ：1/64 -> 12,500Hz                                      */
    /* 一致カウント数設定：250 -> 12,500/250 = 50Hz -> 20ms                 */
    /*====================================================================*/


    /* タイマ4 一致割り込み発生数値 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PR4 = 0xFAU;             /*  1 1 1 1  -  1 0 1 0            */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 250に設定                                                        */
    /*=================================================================*/


    /* DAC設定1 */
    /*=================================================================*/
                            /*  +------------------------- 7 : DACEN   */   /* DAC機能 有効 */
                            /*  | +----------------------- 6 : DACLPS  */   /* DAC省電力 無効 */
                            /*  | | +--------------------- 5 : DACOE   */   /* DAC出力 有効 */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DACPSS1 */   /* DAC HI側基準電圧：VCC 5V */
                            /*  | | | |     | +----------- 2 : DACPSS0 */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : DACNSS  */   /* DAC LO側基準電圧：GND */
    DACCON0 = 0xA0U;        /*  1 0 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* DAC設定2 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : DACR4   */   /* 0/32 -> 0V設定  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DACR3   */
                            /*  | | | |     | +----------- 2 : DACR2   */
                            /*  | | | |     | | +--------- 1 : DACR1   */
                            /*  | | | |     | | | + ------ 0 : DACR0   */
    DACCON1 = 0x00U;        /*  1 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* テンプレート */
    /*=========================================================*/

                            /*  +------------------------- 7 : */
                            /*  | +----------------------- 6 : */
                            /*  | | +--------------------- 5 : */
                            /*  | | | +------------------- 4 : */
                            /*  | | | |                        */
                            /*  | | | |     +------------- 3 : */
                            /*  | | | |     | +----------- 2 : */
                            /*  | | | |     | | +--------- 1 : */
                            /*  | | | |     | | | + ------ 0 : */
        /*  0 0 0 0  -  0 0 1 1            */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  プログラム開始直前の設定                                    */
/*                                                            */
/**************************************************************/
static void func_main_s_program_start( void )
{
    T4CON  |= 0x04U;     /* タイマ4 動作開始 */
    INTCON |= 0x80U;     /* 全体割り込み許可 */
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ4 一致割り込み処理                                    */
/*                                                            */
/**************************************************************/
static void  func_main_s_timer4_match_int_task( void )
{
    u8_main_s_loop_go = SET;
}


